# Найти максимальное число

a=int(input('введите число 1 :'))
b=int(input('введите число 2 :'))
c=int(input('введите число 3 :'))
d=int(input('введите число 4 :'))
s=int(input('введите число 5 :'))
print(max(a,b,c,d,s))